### Import Libaries

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

### import dataset

In [4]:
movie_titles_df = pd.read_csv("movies.csv")
movie_titles_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
movie_titles_df.tail()

       movieId                                title                     genres
10324   146684        Cosmic Scrat-tastrophe (2015)  Animation|Children|Comedy
10325   146878           Le Grand Restaurant (1966)                     Comedy
10326   148238       A Very Murray Christmas (2015)                     Comedy
10327   148626                 The Big Short (2015)                      Drama
10328   149532  Marco Polo: One Hundred Eyes (2015)         (no genres listed)

In [6]:
movie_rating_df = pd.read_csv('ratings.csv')
movie_rating_df

        userId  movieId  rating   timestamp
0            1       16     4.0  1217897793
1            1       24     1.5  1217895807
2            1       32     4.0  1217896246
3            1       47     4.0  1217896556
4            1       50     4.0  1217896523
...        ...      ...     ...         ...
105334     668   142488     4.0  1451535844
105335     668   142507     3.5  1451535889
105336     668   143385     4.0  1446388585
105337     668   144976     2.5  1448656898
105338     668   148626     4.5  1451148148

[105339 rows x 4 columns]

In [7]:
movie_rating_df = movie_rating_df.drop(['timestamp'],axis=1)

In [8]:
movie_rating_df

        userId  movieId  rating
0            1       16     4.0
1            1       24     1.5
2            1       32     4.0
3            1       47     4.0
4            1       50     4.0
...        ...      ...     ...
105334     668   142488     4.0
105335     668   142507     3.5
105336     668   143385     4.0
105337     668   144976     2.5
105338     668   148626     4.5

[105339 rows x 3 columns]

In [9]:
movie_rating_df.describe()

              userId        movieId         rating
count  105339.000000  105339.000000  105339.000000
mean      364.924539   13381.312477       3.516850
std       197.486905   26170.456869       1.044872
min         1.000000       1.000000       0.500000
25%       192.000000    1073.000000       3.000000
50%       383.000000    2497.000000       3.500000
75%       557.000000    5991.000000       4.000000
max       668.000000  149532.000000       5.000000

In [10]:
movie_rating_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105339 entries, 0 to 105338
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   userId   105339 non-null  int64
 1   movieId  105339 non-null  int64
 2   rating   105339 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 2.4 MB

In [11]:
movie_rating_df = pd.merge(movie_rating_df,movie_titles_df, on='movieId')
movie_rating_df

,userId,movieId,rating,title,genres
0,1,16,4.0,Casino (1995),Crime|Drama
1,9,16,4.0,Casino (1995),Crime|Drama
2,12,16,1.5,Casino (1995),Crime|Drama
3,24,16,4.0,Casino (1995),Crime|Drama
4,29,16,3.0,Casino (1995),Crime|Drama
...,...,...,...,...,...
105334,668,140098,2.5,Runoff (2015),Drama
105335,668,140816,2.5,Tangerine (2015),Comedy|Drama
105336,668,141472,2.5,The 50 Year Argument (2014),(no genres listed)
105337,668,142488,4.0,Spotlight (2015),Thriller
105338,668,142507,3.5,Pawn Sacrifice (2015),Drama

In [12]:
movie_rating_df.shape

(105339, 5)